/**
 * Синтетические данные для книги "SQL без слёз"
 * Автор: Артём Санников
 * Год: 2024
 * Ссылка на книгу: https://artemsannikov.ru/books/sql-without-tears/
**/

-- 1 этап: Создаём таблицы

 -- Таблица с сотрудниками
DROP TABLE IF EXISTS employees;

CREATE TABLE employees (
  id int4 NOT NULL, -- Идентификатор сотрудника
  last_name varchar(100) NOT NULL, -- Фамилия
  first_name varchar(100) NOT NULL, -- Имя
  gender varchar(15) NOT NULL, -- Пол
  birthday date NOT NULL, -- Дата рождения
  email varchar(100) NULL, -- Электронный адрес
  id_department int4 NULL, -- Идентификатор отдела
  id_boss int4 NULL, -- Идентификатор руководителя
  salary int4  NULL -- Заработная плата
);

 -- Таблица с отделами
DROP TABLE IF EXISTS departments;

CREATE TABLE departments (
	id int4 NOT NULL, -- Идентификатор отдела
	name_department varchar(100) NULL -- Наименование отдела
);

-- 2 этап: Добавление комментариев к таблицам и их столбцам
COMMENT ON TABLE employees IS 'Список сотрудников';
COMMENT ON COLUMN employees.id IS 'Идентификатор сотрудника';
COMMENT ON COLUMN employees.last_name IS 'Фамилия';
COMMENT ON COLUMN employees.first_name IS 'Имя';
COMMENT ON COLUMN employees.gender IS 'Пол';
COMMENT ON COLUMN employees.birthday IS 'Дата рождения';
COMMENT ON COLUMN employees.email IS 'Электронный адрес';
COMMENT ON COLUMN employees.id_department IS 'Идентификатор отдела';
COMMENT ON COLUMN employees.id_boss IS 'Идентификатор руководителя';
COMMENT ON COLUMN employees.salary IS 'Заработная плата';

COMMENT ON TABLE departments IS 'Список отделов';
COMMENT ON COLUMN departments.id IS 'Идентификатор отдела';
COMMENT ON COLUMN departments.name_department IS 'Наименование отдела';

-- 3 этап: Добавляем данные в таблицы

-- Таблица с сотрудниками
INSERT INTO employees (id, last_name, first_name, gender, birthday, email, id_department, id_boss, salary)
VALUES
(1, 'Иванов', 'Иван', 'Мужской', '1990-05-15', 'ivanov@mail.ru', 1, null, 35000),
(2, 'Петров', 'Петр', 'Мужской', '1985-12-20', 'petrov@yandex.ru', 2, null, 45000),
(3, 'Сидорова', 'Мария', 'Женский', '1992-08-10', 'sidorova@gmail.com', 3, null, 54000),
(4, 'Петров', 'Петр', 'Мужской', '1987-04-25', null, 4, null, 100000),
(5, 'Васильева', 'Екатерина', 'Женский', '1995-03-30', 'vasilieva@yandex.ru', 5, null, 38900),
(6, 'Попов', 'Дмитрий', 'Мужской', '1988-11-05', 'popov@gmail.com', 6, null, 110000),
(7, 'Соколова', 'Анастасия', 'Женский', '1991-07-12', 'sokolova@mail.ru', 1, 1, 40000),
(8, 'Лебедева', 'Алена', 'Женский', '1994-09-18', 'lebedeva@yandex.ru', 2, 2, 68000),
(9, 'Козлов', 'Артём', 'Мужской', '1986-10-22', 'kozlov@gmail.com', 3, 3, 120000),
(10, 'Новиков', 'Андрей', 'Мужской', '1989-06-08', 'novikov@mail.ru', 4, 4, 42000),
(11, 'Морозова', 'Ольга', 'Женский', '1993-02-14', 'morozova@yandex.ru', 5, 5, 70000),
(12, 'Павлов', 'Сергей', 'Мужской', '1987-12-11', 'pavlov@gmail.com', 6, 6, 130000),
(13, 'Григорьева', 'Наталья', 'Женский', '1996-01-25', 'grigoryeva@mail.ru', 1, 1, 60000),
(14, 'Борисов', 'Игорь', 'Мужской', '1985-05-20', 'borisov@yandex.ru', 2, 2, 95000),
(15, 'Максимова', 'Вероника', 'Женский', '1990-08-30', 'maximova@gmail.com', 3, 3, 72000),
(16, 'Кузьмина', 'Елена', 'Женский', '1997-08-15', 'kuzmina@mail.ru', 4, 4, 105000),
(17, 'Егоров', 'Кирилл', 'Мужской', '1986-07-22', null, 5, 5, 62000),
(18, 'Пономарев', 'Денис', 'Мужской', '1989-04-08', 'ponomarev@gmail.com', 6, 6, 108000),
(19, 'Семенова', 'Анна', 'Женский', '1992-02-14', 'semenova@mail.ru', 1, 7, 66000),
(20, 'Федоров', 'Егор', 'Мужской', '1993-09-18', 'f.eg@yandex.ru', 2, 14, 72000),
(21, 'Григорьев', 'Михаил', 'Мужской', '1988-10-25', 'grigoryev@gmail.com', 3, 9, 125000),
(22, 'Миронова', 'Марина', 'Женский', '1995-01-08', 'mironova@mail.ru', 4, 10, 68000),
(23, 'Кудряшов', 'Иван', 'Мужской', '1987-06-20', 'kudryashov@yandex.ru', 5, 11, 80000),
(24, 'Белова', 'Александра', 'Женский', '1986-12-15', 'belova@gmail.com', 6, 12, 115000),
(25, 'Кондратьев', 'Павел', 'Мужской', '1990-12-14', 'kpav@mail.ru', 1, 7, 70000),
(26, 'Мельникова', 'Яна', 'Женский', '1993-07-15', 'melnikova@yandex.ru', 2, 8, 80000),
(27, 'Афанасьев', 'Григорий', 'Мужской', '1995-01-08', 'afanasyev@gmail.com', 3, 15, 110000),
(28, 'Макарова', 'Татьяна', 'Женский', '1992-11-18', 'makaro%va@mail.ru', 4, 10, 65000),
(29, 'Ильина', 'Алёна', 'Женский', '1995-09-30', 'ilina@yandex.ru', 5, 17, 75000),
(30, 'Прокофьев', 'Максим', 'Мужской', '1988-04-05', null, 6, 12, 100000),
(31, 'Семенов', 'Артём', 'Мужской', '1987-08-12', 'semenov@mail.ru', 1, 13, 70000),
(32, 'Карпова', 'Анна', 'Женский', '1990-06-18', 'karp@yandex.ru', 2, 14, 75000),
(33, 'Фомин', 'Дмитрий', 'Мужской', '1994-02-14', 'fomin@gmail.com', 3, 9, 90000),
(34, 'Денисова', 'Вероника', 'Женский', '1997-11-25', 'denisova@mail.ru', 4, 16, 62000),
(35, 'Кузнецова', 'Екатерина', 'Женский', '1991-07-22', 'kuznetsova@yandex.ru', 5, 17, 72000),
(36, 'Макаров', 'Алексей', 'Мужской', '1986-10-08', 'makarov@gmail.com', 6, 18, 115000),
(37, 'Миронов', 'Игорь', 'Мужской', '1988-07-15', 'mironov@mail.ru', 1, 13, 72000),
(38, 'Ковалева', 'Елена', 'Женский', '1995-12-30', 'kovaleva@yandex.ru', 2, 8, 80000),
(39, 'Кудряшова', 'Анастасия', 'Женский', '1990-09-18', 'kudryashova@gmail.com', 3, 15, 100000),
(40, 'Иванова', 'Ольга', 'Женский', '1987-10-25', 'ivanova@mail.ru', 4, 16, 67000),
(41, 'Попова', 'Екатерина', 'Женский', '1993-01-08', 'popova@yandex.ru', 5, 11, 73000),
(42, 'Лебедев', 'Сергей', 'Мужской', '1996-07-14', 'lebedev@gmail.com', 6, 18, 120000),
(43, 'Кузнецов', 'Игорь', 'Мужской', '1985-11-20', null, 1, 7, 75000),
(44, 'Соколов', 'Михаил', 'Мужской', '1989-08-30', 'sokolov@yandex.ru', 2, 14, 85000),
(45, 'Пономарева', 'Максим', 'Женский', '1984-05-28', 'ponomareva@gmail.com', 3, 9, 108000),
(46, 'Семенов', 'Иван', 'Мужской', '1992-06-15', 'semenovi@mail.ru', 4, 10, 64000),
(47, 'Григорьев', 'Павел', 'Мужской', '1987-12-04', 'grigoryev@mail.ru', 5, 11, 77000),
(48, 'Борисова', 'Анна', 'Женский', '1990-10-18', 'borisova@yandex.ru', 6, 18, 95000),
(49, 'Карпов', 'Денис', 'Мужской', '1995-01-20', 'karpov@gmail.com', 1, 13, 68000),
(50, 'Максимов', 'Максим', 'Мужской', '1988-07-28', 'maximov@mail.ru', 2, 14, 102000);

-- Таблица с отделами
INSERT INTO departments (id, name_department)
VALUES
(1, 'Отдел маркетинга'),
(2, 'Отдел финансов'),
(3, 'Отдел разработки'),
(4, 'Отдел кадров'),
(5, 'Отдел логистики'),
(6, 'Отдел качества'),
(7, 'Отдел взыскания'),
(8, 'Отдел безопасности'),
(9, 'Отдел поддержки');
	   
-- 4 этап: Проверка данных в таблицах
	  
SELECT * FROM employees;
SELECT * FROM departments;